; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=74, out_folder=htg/blocksworld/training, instance_id=54, seed=2078, goal_proportion=0.1

(define (problem blocksworld-54)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 - object)
 (:init 
    (arm-empty)
    (clear b29)
    (on-table b29)
    (clear b36)
    (on b36 b32)
    (on b32 b1)
    (on b1 b5)
    (on b5 b40)
    (on b40 b44)
    (on b44 b59)
    (on-table b59)
    (clear b51)
    (on b51 b73)
    (on b73 b38)
    (on b38 b9)
    (on-table b9)
    (clear b34)
    (on-table b34)
    (clear b63)
    (on-table b63)
    (clear b11)
    (on b11 b61)
    (on b61 b50)
    (on b50 b41)
    (on b41 b27)
    (on b27 b2)
    (on b2 b69)
    (on b69 b30)
    (on b30 b35)
    (on b35 b70)
    (on b70 b20)
    (on b20 b65)
    (on-table b65)
    (clear b28)
    (on b28 b19)
    (on-table b19)
    (clear b57)
    (on b57 b8)
    (on b8 b15)
    (on b15 b71)
    (on b71 b42)
    (on-table b42)
    (clear b49)
    (on b49 b33)
    (on-table b33)
    (clear b7)
    (on b7 b16)
    (on b16 b52)
    (on-table b52)
    (clear b14)
    (on b14 b64)
    (on b64 b3)
    (on b3 b66)
    (on-table b66)
    (clear b39)
    (on-table b39)
    (clear b72)
    (on b72 b13)
    (on-table b13)
    (clear b60)
    (on b60 b55)
    (on b55 b21)
    (on b21 b26)
    (on b26 b10)
    (on b10 b58)
    (on-table b58)
    (clear b24)
    (on-table b24)
    (clear b17)
    (on b17 b53)
    (on b53 b22)
    (on-table b22)
    (clear b54)
    (on-table b54)
    (clear b23)
    (on b23 b67)
    (on-table b67)
    (clear b37)
    (on-table b37)
    (clear b31)
    (on b31 b43)
    (on b43 b4)
    (on b4 b56)
    (on b56 b18)
    (on b18 b68)
    (on-table b68)
    (clear b48)
    (on-table b48)
    (clear b12)
    (on b12 b46)
    (on-table b46)
    (clear b47)
    (on-table b47)
    (clear b45)
    (on b45 b62)
    (on b62 b74)
    (on-table b74)
    (clear b25)
    (on b25 b6)
    (on-table b6))
 (:goal  (and 
    (clear b3)
    (on b3 b2)
    (on b2 b7)
    (on b7 b4)
    (on b4 b5)
    (on b5 b1)
    (on b1 b6)
    (on-table b6))))

; plan
1. (unstack b14 b64)
   deleted: (on b14 b64) (clear b14) (arm-empty)
   added: (holding b14) (clear b64)
   goals met: 1 of 8
2. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 8
3. (unstack b64 b3)
   deleted: (on b64 b3) (clear b64) (arm-empty)
   added: (holding b64) (clear b3)
   goals met: 2 of 8
4. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 2 of 8
5. (unstack b31 b43)
   deleted: (on b31 b43) (clear b31) (arm-empty)
   added: (holding b31) (clear b43)
   goals met: 2 of 8
6. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 8
7. (unstack b43 b4)
   deleted: (on b43 b4) (clear b43) (arm-empty)
   added: (holding b43) (clear b4)
   goals met: 2 of 8
8. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 2 of 8
9. (unstack b7 b16)
   deleted: (on b7 b16) (clear b7) (arm-empty)
   added: (holding b7) (clear b16)
   goals met: 2 of 8
10. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 3 of 8
11. (unstack b25 b6)
   deleted: (on b25 b6) (clear b25) (arm-empty)
   added: (holding b25) (clear b6)
   goals met: 3 of 8
12. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 3 of 8
13. (unstack b36 b32)
   deleted: (on b36 b32) (clear b36) (arm-empty)
   added: (holding b36) (clear b32)
   goals met: 3 of 8
14. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 8
15. (unstack b32 b1)
   deleted: (on b32 b1) (clear b32) (arm-empty)
   added: (holding b32) (clear b1)
   goals met: 3 of 8
16. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 3 of 8
17. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 3 of 8
18. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 4 of 8
19. (unstack b5 b40)
   deleted: (on b5 b40) (clear b5) (arm-empty)
   added: (holding b5) (clear b40)
   goals met: 4 of 8
20. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 5 of 8
21. (unstack b11 b61)
   deleted: (on b11 b61) (clear b11) (arm-empty)
   added: (holding b11) (clear b61)
   goals met: 5 of 8
22. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 5 of 8
23. (unstack b61 b50)
   deleted: (on b61 b50) (clear b61) (arm-empty)
   added: (holding b61) (clear b50)
   goals met: 5 of 8
24. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 5 of 8
25. (unstack b50 b41)
   deleted: (on b50 b41) (clear b50) (arm-empty)
   added: (holding b50) (clear b41)
   goals met: 5 of 8
26. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 5 of 8
27. (unstack b41 b27)
   deleted: (on b41 b27) (clear b41) (arm-empty)
   added: (holding b41) (clear b27)
   goals met: 5 of 8
28. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 5 of 8
29. (unstack b27 b2)
   deleted: (on b27 b2) (clear b27) (arm-empty)
   added: (holding b27) (clear b2)
   goals met: 5 of 8
30. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 5 of 8
31. (unstack b3 b66)
   deleted: (on b3 b66) (clear b3) (arm-empty)
   added: (holding b3) (clear b66)
   goals met: 4 of 8
32. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 6 of 8
33. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 5 of 8
34. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 8
35. (unstack b4 b56)
   deleted: (on b4 b56) (clear b4) (arm-empty)
   added: (holding b4) (clear b56)
   goals met: 5 of 8
36. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 6 of 8
37. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 8
38. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 7 of 8
39. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 5 of 8
40. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 8
41. (unstack b2 b69)
   deleted: (on b2 b69) (clear b2) (arm-empty)
   added: (holding b2) (clear b69)
   goals met: 6 of 8
42. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 7 of 8
43. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 8
44. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 8 of 8
